[
  {
    "title": ".Net Developer (At Least 2 Years )",
    "job_description": [
      "- Collaborate with clients and teams to gather requirements and plan tasks.\n- Develop applications, optimize systems, and contribute innovative ideas.\n- Write code, test, and maintain technical documentation.\n- Explore new technologies and propose performance improvements.\n- Opportunity to lead your own project/module.\n- Gain hands-on experience across the full software development lifecycle."
    ],
    "requirements": [
      "- Bachelor’s degree in Information Technology, Computer Science, or a related field.\n- At least 2 years of backend software development experience using .NET technologies.\n- Solid experience in requirements analysis, software design, and application architecture.\n- Proficient in Golang, .NET, ASP.NET Core, MVC, Web API, and Entity Framework Core.\n- Technical foundation in SQL Server/PostgreSQL, frontend basics (HTML, CSS, Bootstrap, JavaScript), and knowledge of server-side systems (microservices, WebSocket)\n- Experience in requirements analysis, software design, and application architecture.\n- Proactive, creative, good communication skills, and able to work well in a team\nYou will stand out if you have:\n- Experience with Agile/Scrum, CI/CD, and deploying critical software\n- Experience with payment applications, peripheral devices (NFC, printers, cameras), or eKYC platforms (face detection, liveness, image processing)\n- Strong skills in analysis, problem-solving, design, coding, and debugging applications\n- Reading and writing English skills sufficient for work purposes"
    ],
    "salary": {},
    "location": "Hà Nội",
    "experience": {
      "min_years": 2
    },
    "url": "https://www.topcv.vn/viec-lam/net-developer-at-least-2-years/1989199.html?ta_source=ITJobs_LinkDetail"
  },
  {
    "title": "Lập Trình Viên Web (C#, .Net) - Từ 1 Năm Kinh Nghiệm",
    "job_description": [
      "+2"
    ],
    "requirements": [
      "Tốt nghiệp ĐH/CĐ chuyên ngành CNTT hoặc các chuyên ngành liên quan\nCó tối thiểu 1 năm kinh nghiệm lập trình .NET trên nền tảng Web\nThành thạo HTML, Java Script/Jquery, CSS\nThành thạo các kiến thức về .NET Framework hoặc .NET Core (C#, ASP.NET, MVC, ...) Có kinh nghiệm xây dựng các hệ thống sử dụng .NET là lợi thế\nƯu tiên ứng viên có kinh nghiệm làm việc với Web API\nCó kinh nghiệm với 1 trong các cơ sở dữ liệu SQL Server, MySQL, PostgreSQL. Đã từng làm sản phẩm sử dụng NoSQL: MongoDB, CouchBase, Redis, RabbitMQ, … là lợi thế\nCó kiến thức về OOP, Design Pattern, nguyên lý SOLID, SOA/Micro Service\nƯu tiên ứng viên thích làm product, tư duy làm sản phẩm cao, sản phẩm hướng người dùng cuối.\nGiao tiếp tốt, chủ động, khả năng làm việc nhóm tốt"
    ],
    "salary": {
      "min": 25,
      "max": 30
    },
    "location": "Hà Nội",
    "experience": {
      "min_years": 1
    },
    "url": "https://www.topcv.vn/viec-lam/lap-trinh-vien-web-c-net-tu-1-nam-kinh-nghiem/1978491.html?ta_source=ITJobs_LinkDetail"
  },
  {
    "title": "Lập Trình Viên .NET - Thu Nhập Đến 18 Triệu + Thưởng + Phụ Cấp - Đi Làm Ngay, Nghỉ Thứ 7",
    "job_description": [
      "+1"
    ],
    "requirements": [
      "Nắm vững nền tảng Lập trình hướng đối tượng (OOP).\nThành thạo ngôn ngữ C#, có kinh nghiệm làm việc với .NET Framework hoặc .NET Core.\nHiểu rõ mô hình MVC, có khả năng xây dựng và tích hợp Web API.\nCó kỹ năng Frontend cơ bản: JavaScript, jQuery, Ajax, HTML, CSS.\nCẩn thận, tỉ mỉ và có trách nhiệm cao với sản phẩm.\nCó ý thức cầu tiến, tinh thần kỉ luật, nhạy bén, trung thực.\nƯu tiên:\n+ Đã từng thực hiện dự án thực tế với ASP.NET MVC / .NET Core.\n+ Có kiến thức về Cơ sở dữ liệu (MySQL/SQL Server) và Entity Framework.\n+ Kinh nghiệm làm các phần mềm nghiệp vụ, ERP hoặc hệ thống quản lý.\n+ Biết deploy trên IIS, cấu hình môi trường Windows Server.\n+ Thành thạo Git (Có Git Repo demo là một lợi thế lớn."
    ],
    "salary": {
      "min": 10,
      "max": 18
    },
    "location": "Hà Nội",
    "experience": {
      "min_years": 2
    },
    "url": "https://www.topcv.vn/viec-lam/lap-trinh-vien-net-thu-nhap-den-18-trieu-thuong-phu-cap-di-lam-ngay-nghi-thu-7/1982488.html?ta_source=ITJobs_LinkDetail"
  },
  {
    "title": ".NET Developer (C#)",
    "job_description": [
      "Tham gia đội ngũ kỹ thuật, trực tiếp phát triển các module phần mềm trên nền tảng công nghệ Microsoft (.NET 9) & Azure:\nPhát triển ứng dụng: Xây dựng các API Backend, xử lý logic nghiệp vụ và tương tác dữ liệu dựa trên kiến trúc Clean Architecture.\nKiểm soát chất lượng: Viết Unit Test, thực hiện Debug và tối ưu hóa code để đảm bảo tính ổn định của hệ thống.\nCơ sở dữ liệu: Thiết kế và thao tác dữ liệu trên SQL Server thông qua Entity Framework Core.\nHợp tác đa chức năng: Phối hợp với đội ngũ Frontend (ReactJS) và DevOps để tích hợp hệ thống và triển khai lên môi trường Azure Cloud."
    ],
    "requirements": [
      "Nền tảng Kỹ thuật (Core Foundation):\nTốt nghiệp Đại học/Cao đẳng chuyên ngành CNTT.\nNắm vững kiến thức về Cấu trúc dữ liệu & Giải thuật, Lập trình hướng đối tượng (OOP).\nCó kiến thức nền tảng về Cơ sở dữ liệu quan hệ (RDBMS) và ngôn ngữ SQL.\nKhả năng thích nghi (Adaptability):\nCó tư duy lập trình tốt trên ít nhất một ngôn ngữ Backend (C#, Java, PHP, NodeJS...).\nSẵn sàng học hỏi và chuyển đổi sang stack công nghệ .NET 9 & Azure theo định hướng của dự án.\nCó tư duy mở với các công nghệ Frontend (ReactJS/VueJS) là một lợi thế.\nKỹ năng mềm:\nKhả năng đọc hiểu tài liệu kỹ thuật tiếng Anh.\nTuân thủ kỷ luật và quy trình phát triển phần mềm (Agile/Scrum)."
    ],
    "salary": {},
    "location": "Hà Nội",
    "experience": {
      "min_years": 1
    },
    "url": "https://www.topcv.vn/viec-lam/net-developer-c/1983277.html?ta_source=ITJobs_LinkDetail"
  },
  {
    "title": "Fullstack Developer (.Net,Python,NodeJS, ReactJS)",
    "job_description": [
      "Chịu trách nhiệm phát triển Backend & Frontend cho các ứng dụng trong lĩnh vực Logistic, Fintech, E-Learning,... sử dụng công nghệ .Net, Python, JavaScript, TypeScript, bao gồm:\nDựng khung cho ứng dụng Backend, Frontend đảm bảo yếu tố dễ maintain và tái sử dụng cho nhiều dự án (với vị trí Senior hoặc Middle)\nDựng UI cho ứng dụng theo thiết kế UI/UX/Wireframes\nViết API cho các ứng dụng frontend (web, mobile) theo chuẩn RESTful, GraphQL\nXây dựng ứng dụng responsive, tương thích với đa trình duyệt, SEO-Friendly, tối ưu hóa về mặt băng thông và bộ nhớ\nViết tài liệu mô tả chức năng\nViết Unit tests\nĐảm bảo các công việc được giao thực hiện đúng thời hạn và chất lượng tốt.\nPhối hợp, hỗ trợ thành viên trong dự án hoàn thành công việc chung của dự án.\nNghiên cứu các công nghệ theo hướng dẫn của trưởng nhóm"
    ],
    "requirements": [
      "Có tối thiểu 1 năm kinh nghiệm phát triển Backend bằng . Net hoặc Python\nCó tối thiểu 1 năm kinh nghiệm phát triển Frontend bằng ReactJS hoặc VueJS\nCó hiểu biết về giao thức TCP/IP, cơ chế giao tiếp Backend - Frontend\nCó hiểu biết về kiến trúc Microservices\nNắm vững kiến thức lập trình hướng đối tượng, kiến thức cơ bản về Cấu trúc dữ liệu & Giải thuật\nNắm vững kiến thức cơ bản về lập trình SQL và hiểu biết về SQL Server, NoSQL (MongoDB, DynamoDB)\nCó hiểu biết về Redis, RabbitMQ\nThành thạo Html5/ CSS/ Bootstrap\nCó kinh nghiệm phát triển ứng dụng responsive, xử lý các vấn đề tương thích đa trình duyệt\nCó kỹ năng triển khai ứng dụng frontend & backend trên Docker\nCó khả năng đọc hiểu tài liệu Tiếng Anh\nCó kinh nghiệm làm việc với Git và các hệ thống source control\nChủ động & trách nhiệm với công việc\nCó tư duy logic tốt & làm việc nhóm hiệu quả\nCó kỹ năng quản lý thời gian tốt, giao tiếp & kỹ năng xử lý vấn đề tốt\nYếu tố lợi thế:\nĐam mê công nghệ, sẵn sàng thử thách làm các công nghệ khác nhau\nCó kinh nghiệm làm việc với abp. io framework, Entity Framework hoặc Python\nCó kinh nghiệm với NodeJS và AngularJS\nCó kinh nghiệm làm việc trên nhiều môi trường server: Windows server, Linux server\nCó kinh nghiệm triển khai dự án dùng dịch vụ AWS, Azure\nCó khả năng giao tiếp Tiếng Anh với Khách hàng nước ngoài\nCó kỹ năng leadership với ứng viên Senior"
    ],
    "salary": {
      "min": 15,
      "max": 45
    },
    "location": "Hà Nội",
    "experience": {
      "min_years": 1
    },
    "url": "https://www.topcv.vn/viec-lam/fullstack-developer-net-python-nodejs-reactjs/1508986.html?ta_source=ITJobs_LinkDetail"
  }
]