[
  {
    "title": ".Net Developer (At Least 2 Years )",
    "salary_raw": "Thoả thuận",
    "location": "Hà Nội",
    "experience": "2 năm",
    "job_description": [
      "- Collaborate with clients and teams to gather requirements and plan tasks.\n- Develop applications, optimize systems, and contribute innovative ideas.\n- Write code, test, and maintain technical documentation.\n- Explore new technologies and propose performance improvements.\n- Opportunity to lead your own project/module.\n- Gain hands-on experience across the full software development lifecycle."
    ],
    "requirements": [
      "- Bachelor’s degree in Information Technology, Computer Science, or a related field.\n- At least 2 years of backend software development experience using .NET technologies.\n- Solid experience in requirements analysis, software design, and application architecture.\n- Proficient in Golang, .NET, ASP.NET Core, MVC, Web API, and Entity Framework Core.\n- Technical foundation in SQL Server/PostgreSQL, frontend basics (HTML, CSS, Bootstrap, JavaScript), and knowledge of server-side systems (microservices, WebSocket)\n- Experience in requirements analysis, software design, and application architecture.\n- Proactive, creative, good communication skills, and able to work well in a team\nYou will stand out if you have:\n- Experience with Agile/Scrum, CI/CD, and deploying critical software\n- Experience with payment applications, peripheral devices (NFC, printers, cameras), or eKYC platforms (face detection, liveness, image processing)\n- Strong skills in analysis, problem-solving, design, coding, and debugging applications\n- Reading and writing English skills sufficient for work purposes"
    ],
    "url": "https://www.topcv.vn/viec-lam/net-developer-at-least-2-years/1989199.html?ta_source=ITJobs_LinkDetail"
  },
  {
    "title": "Senior .NET (C#) Developer (Factory Management System) - Từ 3 Năm Kinh Nghiệm - Upto 1.500 - Đi Làm Ngay",
    "salary_raw": "Tới 1,500 USD",
    "location": "Hà Nội",
    "experience": "3 năm",
    "job_description": [
      "Thiết kế, phát triển và tối ưu hệ thống quản lý nhà máy sử dụng C# (WinForms/WPF) trên .NET Framework / .NET 6/7/8.\nTham gia toàn bộ vòng đời phát triển phần mềm: phân tích yêu cầu – thiết kế – coding – testing – release.\nLàm việc với dữ liệu lớn, tối ưu SQL Server (query, indexing, performance, memory).\nXây dựng và duy trì Unit Test / Integration Test / E2E Test, tích hợp vào CI pipeline.\nThực hiện code review, xây dựng coding standard và mentoring kỹ thuật cho team.\nHỗ trợ vận hành production: monitoring, phân tích log, xử lý sự cố, exception tracking, RCA.\nTham gia xây dựng CI/CD (Azure DevOps, GitHub Actions, Jenkins), hỗ trợ Docker khi cần.\nPhối hợp với PM, QC và khách hàng Nhật/Anh để phân tích yêu cầu và đảm bảo chất lượng bàn giao.\nĐề xuất cải tiến kỹ thuật: hiệu năng, bảo mật, hiện đại hóa hệ thống (.NET migration), tự động hóa workflow (bao gồm AI)."
    ],
    "requirements": [
      "Bắt buộc:\nTối thiểu 3 - 4 năm kinh nghiệm .NET (ưu tiên 5+ năm với hệ thống lớn).\nThành thạo C#, .NET Framework / .NET 6+, WinForms hoặc WPF.\nCó kinh nghiệm Backend/API: ASP.NET MVC, Web API.\nThành thạo SQL Server, ORM (Entity Framework / Dapper).\nCó kinh nghiệm unit/integration testing và làm việc với CI pipeline.\nHiểu và có kinh nghiệm tối ưu hiệu năng (CPU, memory, I/O).\nKỹ năng giải quyết vấn đề, giao tiếp và ra quyết định kỹ thuật tốt.\nNên có:\nKinh nghiệm với MES / ERP / Factory System.\nSử dụng ActiveReports hoặc công cụ reporting tương đương.\nKinh nghiệm hoặc chứng chỉ AWS / Azure.\nHiểu biết DDD, CQRS, Event-driven Architecture.\nCó kinh nghiệm áp dụng AI / Automation trong phát triển phần mềm.\nQuen thuộc với môi trường làm việc và văn hóa Nhật Bản.\nKINH NGHIỆM AI (ĐÁNH GIÁ CAO)\nĐã sử dụng GitHub Copilot, ChatGPT, Claude, Azure AI trong công việc.\nỨng dụng AI để tự động hóa workflow (sinh unit test, code template, phân tích log, tài liệu).\nCó kinh nghiệm tích hợp AI API (OpenAI / Azure OpenAI) vào hệ thống.\nTư duy chủ động sử dụng AI để nâng cao năng suất và chất lượng code."
    ],
    "url": "https://www.topcv.vn/viec-lam/senior-net-c-developer-factory-management-system-tu-3-nam-kinh-nghiem-upto-1-500-di-lam-ngay/1993438.html?ta_source=ITJobs_LinkDetail"
  },
  {
    "title": "Thực Tập Sinh Software (.Net)",
    "salary_raw": "",
    "location": "",
    "experience": "Không yêu cầu",
    "job_description": [
      "Chúng tôi chờ đón các bạn sinh viên với đam mê công nghệ và bản lĩnh chinh phục những “bài toán khó”, cùng ELCOM góp mình vào sứ mệnh mang công nghệ kiến tạo cuộc sống thông minh và nhân văn hơn cho người Việt.\n\nCác bạn sẽ được tham gia nghiên cứu và phát triển các dự án công nghệ thực tế thuộc những lĩnh vực chiến lược của ELCOM, đồng thời được định hướng để nâng cao kỹ năng chuyên môn, kỹ năng mềm và tư duy công nghệ. Sau thời gian tham gia chương trình, các bạn có cơ hội trở thành nhân viên chính thức tại ELCOM – Top 10 Doanh nghiệp Công nghệ thông tin hàng đầu Việt Nam, với mức đãi ngộ cạnh tranh và lộ trình phát triển rõ ràng."
    ],
    "requirements": [
      "Sinh viên năm cuối Đại học các ngành: Kỹ thuật máy tính, Công nghệ thông tin, hoặc các chuyên ngành liên quan.\nĐiểm trung bình tích lũy từ 3.2/4.0 trở lên\nCó khả năng làm việc fulltime hoặc parttime tối thiểu 70% số buổi/tuần(28 giờ/ tuần)\nCó hiểu biết về design patterns\nCó hiểu biết về một trong các js framework là một lợi thế.\nƯu tiên ứng viên đã sử dụng một trong các CSDL quan hệ (Mysql, Oracle).\nTiếng Anh đọc hiểu tài liệu Kỹ thuật.\nYêu thích công nghệ, sẵn sàng học hỏi, tư duy logic tốt, trách nhiệm với công việc."
    ],
    "url": "https://www.topcv.vn/viec-lam/thuc-tap-sinh-software-net/1988748.html?ta_source=ITJobs_LinkDetail"
  },
  {
    "title": "Fresher Web Developer (C#, .NET)",
    "salary_raw": "Tới 4 triệu",
    "location": "Hà Nội",
    "experience": "Không yêu cầu",
    "job_description": [
      "Lộ trình đào tạo Fullstack và cơ hội trở thành nhân viên của MISA chỉ sau 1 tháng: học và thực hành, làm bài tập, đánh giá về về các kiến thức nền tảng, kỹ thuật Debug với Vue, UI Convention, ngôn ngữ C#, .Netcore, Config, dựng Sever với ASP.NET Core,..."
    ],
    "requirements": [
      "- Sinh viên cuối năm 3, năm 4 hoặc tốt nghiệp ĐH trở lên các chuyên ngành: Công nghệ thông tin, công nghệ phần mềm, kỹ thuật phần mềm, khoa học máy tính\n- Thời gian làm việc: Yêu cầu fulltime\n- Đã có kinh nghiệm thực tập hoặc có các project cá nhân về mảng web\n- Điểm tích lũy GPA từ 3.0 trở lên\n- Có kiến thức về OOP, HTML, CSS. JS, Database\n- Sử dụng ít nhất 1 hệ quản trị CSDL như MySQL, SQL Server.\n- Biết sử dụng Vue, Angular, React là một lợi thế."
    ],
    "url": "https://www.topcv.vn/viec-lam/fresher-web-developer-c-net/1992413.html?ta_source=ITJobs_LinkDetail"
  }
]