[
  {
    "title": "Frontend Team Lead (ReactJS/NextJS/React Native)",
    "salary_raw": "2,700 - 3,300 USD",
    "location": "Hà Nội",
    "experience": "Trên 5 năm",
    "job_description": [
      ""
    ],
    "requirements": [
      "Qualifications Education: Bachelor’s or Master’s degree in Computer Science, Software Engineering, or related fields.\nTechnical Knowledge & Expertise\n● Good English proficiency.\n● Advanced knowledge of JavaScript frameworks: ReactJS, NextJS, React Native, Redux.\n● Strong command of HTML, CSS, JavaScript, React, and TypeScript for building modern, responsive applications.\n● Experience with Git-based version control platforms such as GitHub or Bitbucket.\n● Knowledge of publishing applications on both iOS and Android.\n● Familiarity with MS Office, Jira, and Slack is a plus.\n● Solid understanding of full application development lifecycle: ideation, planning, documentation, and leading large-scale projects.\n● Ability to write clean, maintainable, and well-structured code.\nExperience\n● 7+ years of software development experience, and;\n● At least 2 years of experience in a FE technical lead or supervisory role\nSoft Skills\n● Strong communication and interpersonal skills.\n● Excellent problem-solving and analytical thinking.\n● Effective time management and ability to prioritize.\n● Positive, proactive “can-do” mindset.\n● Ability to explain design and technical decisions clearly and confidently.\n● High sense of responsibility and ownership over team deliverables.\n● Adaptability and openness to new technologies, tools, and methodologies.\n● Strong teamwork and collaboration capabilities."
    ],
    "url": "https://www.topcv.vn/viec-lam/frontend-team-lead-reactjs-nextjs-react-native/1990648.html?ta_source=ITJobs_LinkDetail"
  },
  {
    "title": "Front End Developer (ReactJS, VueJS, HTML) - Tại Hà Nội",
    "salary_raw": "Thoả thuận",
    "location": "Hà Nội",
    "experience": "3 năm",
    "job_description": [
      "Design, develop, and maintain user interfaces for web applications.\nCollaborate with UX/UI Designers to ensure intuitive and user-friendly interfaces.\nIntegrate APIs and back-end services to deliver full features.\nOptimize interface performance (loading speed, cross-device compatibility).\nWrite clean, reusable, and maintainable code.\nAnalyze and troubleshoot front-end issues.\nStay updated and apply the latest technologies and frameworks."
    ],
    "requirements": [
      "[Required]\nHave at least 3 years of experience (Prioritize high experience)\nExperienced web / mobile application development\nCan develop HTML, CSS, Javascript, jQuery\nCan develop based on React.js or Vue.js, Vuex\nExperienced with collaboration tools like Git, Jira and Confluence\nUnderstand and use CI/CD\nEnglish speaking on average (or TOEIC on 550)\n[Preferred]\nUnderstand Back-end\nUse Typescript\nExperienced with Node.js\nExperienced with javascript charts (Echarts, Chart.js, d3js, etc.)\nExperience using Tailwind, MUI\nOAuth development experience\nKorean communication\nTeam management experience"
    ],
    "url": "https://www.topcv.vn/viec-lam/front-end-developer-reactjs-vuejs-html-tai-ha-noi/1575383.html?ta_source=ITJobs_LinkDetail"
  },
  {
    "title": "Fullstack Developer (Node.Js, TypeScript, Và React JS-Từ 3 Năm Kinh Nghiệm)",
    "salary_raw": "Thoả thuận",
    "location": "Hà Nội",
    "experience": "3 năm",
    "job_description": [
      "Phát triển và duy trì các ứng dụng web sử dụng Node.js, TypeScript, và React JS.\nThiết kế giao diện người dùng (UI) responsive và tối ưu trải nghiệm người dùng (UX) với Tailwind CSS.\nLàm việc với cơ sở dữ liệu MySQL và MongoDB để xây dựng và tối ưu hóa các truy vấn dữ liệu.\nTham gia vào toàn bộ vòng đời phát triển phần mềm, từ phân tích yêu cầu, thiết kế, coding, đến kiểm thử và triển khai.\nPhối hợp với các thành viên trong nhóm (Frontend, Backend, QA) để đảm bảo chất lượng sản phẩm.\nĐề xuất và triển khai các cải tiến kỹ thuật để nâng cao hiệu suất và khả năng mở rộng của ứng dụng.\nViết mã sạch, dễ bảo trì và tuân thủ các tiêu chuẩn coding tốt nhất.\nTham gia review code và hỗ trợ các thành viên khác trong nhóm.\nThực hiện các công việc khác theo yêu cầu của lãnh đạo."
    ],
    "requirements": [
      "Tốt nghiệp đại học chuyên ngành Công nghệ Thông tin, Khoa học Máy tính hoặc các lĩnh vực liên quan.\nCó từ 3 năm kinh nghiệm làm việc thực tế với Node.js, TypeScript, và React JS.\nThành thạo Tailwind CSS để xây dựng giao diện responsive và hiện đại.\nCó kinh nghiệm làm việc với cơ sở dữ liệu MySQL và MongoDB, bao gồm thiết kế schema và tối ưu hóa truy vấn.\nHiểu biết tốt về các khái niệm phát triển web như RESTful API, asynchronous programming, và state management trong React.\nCó khả năng làm việc nhóm tốt, giao tiếp hiệu quả và sẵn sàng học hỏi công nghệ mới.\nKỹ năng giải quyết vấn đề và tư duy logic tốt.\nƯu tiên ứng viên có kinh nghiệm với các công cụ như Git, Docker, hoặc CI/CD pipelines.\nCó kinh nghiệm làm việc trong môi trường Agile/Scrum là một lợi thế."
    ],
    "url": "https://www.topcv.vn/viec-lam/fullstack-developer-node-js-typescript-va-react-js-tu-3-nam-kinh-nghiem/1993311.html?ta_source=ITJobs_LinkDetail"
  },
  {
    "title": "Full Stack Developer (Java, Springboot, React)",
    "salary_raw": "Thoả thuận",
    "location": "Hà Nội",
    "experience": "1 năm",
    "job_description": [
      "LG CNS is looking for full stack developers for cloud domain project\nDevelop and maintain fullstack web applications using Java (Spring Boot) on backend and React.js on frontend.\nParticipate in the entire software development lifecycle, from requirements gathering, analysis, design to deployment and maintenance.\nConduct unit testing and support integration testing.\nEnsure code quality, performance, and scalability.\nMaintain technical documentation and follow coding standards."
    ],
    "requirements": [
      "[Required]\nBachelor's degree of Information Technology or higher\nHave working experience and excellent knowledge at software developing using Java, Spring boot\nHave working experience and excellent knowledge at software developing using React, HTML, JavaScript\nGood knowledge about AI (Azure OpenAI and GenAI)\nGood knowledge about public cloud (Azure, AWS,)\nDatabase: MariaDB (or MySQL).\n[Preferred]\nHaving experience with Python and Google cloud"
    ],
    "url": "https://www.topcv.vn/viec-lam/full-stack-developer-java-springboot-react/1783213.html?ta_source=ITJobs_LinkDetail"
  },
  {
    "title": "Internship - PHP/React Native Developer",
    "salary_raw": "Thoả thuận",
    "location": "Hồ Chí Minh (mới)",
    "experience": "Dưới 1 năm",
    "job_description": [
      "Tham gia xây dựng và phát triển hệ thống phần mềm quản lý của công ty, gồm các hệ thống quản lý kho vận, nhân sự, kế toán, chăm sóc khách hàng…;\nTham gia xây dựng và phát triển ứng dụng Android và IOS trên nền tảng React Native\nLập trình các module phần mềm theo yêu cầu và chỉ dẫn của cấp trên và theo nhu cầu của các phòng ban;\nTìm hiểu nghiệp vụ, đề xuất giải pháp và lập trình các module, phần mềm theo dự án được giao;\nThực hiện sửa các lỗi phát hiện trong quá trình phát triển hệ thống;"
    ],
    "requirements": [
      "Sinh viên năm 3, năm 4 hoặc mới tốt nghiệp.\nHiểu biết về PHP, Javascript , HTML\nHiểu biết về database (MYSQL,MS SQL, Oracle ...)\nHiểu biết về React Native."
    ],
    "url": "https://www.topcv.vn/viec-lam/internship-php-react-native-developer/1981426.html?ta_source=ITJobs_LinkDetail"
  }
]