[
  {
    "title": "Senior Developer With AI Skill (Java/ C++/ Python/ C#) - Thu Nhập Từ 15-30 Triệu [Hà Nội]",
    "salary_raw": "15 - 30 triệu",
    "location": "Hà Nội",
    "experience": "3 năm",
    "job_description": [
      "Nghiên cứu và đánh giá tính khả thi về mặt kỹ thuật của các giải pháp liên quan đến AI (Machine Learning / Deep Learning / Generative AI).\nXây dựng prototype (chủ yếu trên nền tảng web) để kiểm chứng ý tưởng và giải pháp AI.\nTham gia trao đổi, thảo luận kỹ thuật và báo cáo tiến độ với Manager.\nPhối hợp trao đổi, giải thích giải pháp và đề xuất kỹ thuật với khách hàng khi cần.\nThực hiện Design, Coding, Code Review, Unit test, Fix bugs;\nNội dung công việc chi tiết sẽ được trao đổi khi phỏng vấn."
    ],
    "requirements": [
      "Tốt nghiệp ĐH chuyên ngành CNTT/Các trung tâm lập trình từ 3 năm trở lên\nCó tối thiểu 1 năm kinh nghiệm thực tế về AI, bao gồm: Machine Learning / Deep Learning, Generative AI (GenAI)\nCó tối thiểu 2 năm kinh nghiệm phát triển ứng dụng với ít nhất một trong các ngôn ngữ/framework sau: Java, C#, C++, Python, ReactJS, VueJS\nCó khả năng:\n+ Phân tích bài toán\n+ Thiết kế và triển khai thuật toán để giải quyết vấn đề thực tế\nTư duy logic tốt, cẩn thận, chủ động học hỏi, yêu thích nghiên cứu công nghệ mới.\nCó khả năng trao đổi, trình bày và đề xuất giải pháp kỹ thuật cho khách hàng.\nCó khả năng tự điều tra, xử lý tình huống tốt, có trách nhiệm và chịu được áp lực công việc;\nOptional:\nCó kinh nghiệm về cloud(Azure, AWS, GCP);\nCó kinh nghiệm sử dụng hoặc triển khai CI/CD;\nCó kinh nghiệm phát triển hoặc xây dựng các hệ thống DWH;\nCó kinh nghiệm thiết kế hệ thống, đảm bảo security;\nCó kinh nghiệm làm việc trong môi trường Nhật."
    ],
    "url": "https://www.topcv.vn/viec-lam/senior-developer-with-ai-skill-java-c-python-c-thu-nhap-tu-15-30-trieu-ha-noi/1914882.html?ta_source=ITJobs_LinkDetail"
  },
  {
    "title": "Backend Python Developer For AI Agent Development Project",
    "salary_raw": "Thoả thuận",
    "location": "Hà Nội",
    "experience": "4 năm",
    "job_description": [
      "Leading the way in financial IT service market in Korea, we now seek to expand our expertise to the APAC\nParticipation in R&D AI Agent development Project Solution Development\nSolution Development (Backend)\nRequirements analysis and design for a specific solution\nEnsuring solution quality"
    ],
    "requirements": [
      "Java programming experience\nDeveloped based on Spring, Spring Boot F/W, Spring MVC\nWeb application development experience (4 years or more)\nRDBMS (MySQL, PostgreSQL, MariaDB) & SQL\nGood knowledge of SQL database management and optimization\nGood knowledge of backend security, cryptography, and authentication protocols\nExperience with collaboration tools such as Git, Jira and Confluence\nExcellent communication skills and ability to work well in cross-functional teams\nCommunicate in English at an average level"
    ],
    "url": "https://www.topcv.vn/viec-lam/backend-python-developer-for-ai-agent-development-project/1997032.html?ta_source=ITJobs_LinkDetail"
  },
  {
    "title": "Backend Developer (NodeJS, Java, Python) - Upto 40M - Đi Làm Ngay",
    "salary_raw": "20 - 40 triệu",
    "location": "Hồ Chí Minh (mới)",
    "experience": "3 năm",
    "job_description": [
      "Responsibilities\n• Develop and maintain backend systems for real-time gaming and web chat applications.\n• Proficient in Node.JS, PHP, Laravel, MySQL, Redis, and CentOS\n• Familiar with Golang, RESTful services, Python, Ruby, Java\n• Experience with NoSQL and cache systems such as MongoDB and Redis\n• Proficient with Git, Linux, Docker, and Kubernetes (K8S)\n• Skilled in MS SQL and PostgreSQL database setup and management\n• Experience with multi-threaded programming and high-load system architecture.\n• Write and maintain technical documentation for projects"
    ],
    "requirements": [
      "What We Are Looking\n• Proficient in Node.JS, Java, Python, Ruby, or PHP\n• MySQL, PostgreSQL, NestJS\n• Minimum 3 years of experience in the same position.\n• Open mindset for AI and innovation; skilled in using creative AI tools.\n• Detail-oriented with strong problem-solving skills.\n• Strong self-learning skills, proficient with Git\n• Must bring work samples to interview.\n• Good English communication skills"
    ],
    "url": "https://www.topcv.vn/viec-lam/backend-developer-nodejs-java-python-upto-40m-di-lam-ngay/1988073.html?ta_source=ITJobs_LinkDetail"
  },
  {
    "title": "Backend Developer (Python) - Mức Lương 30tr/Tháng - Khu Vực Cầu Giấy",
    "salary_raw": "Từ 30 triệu",
    "location": "Hà Nội",
    "experience": "3 năm",
    "job_description": [
      "Thiết kế và phát triển API, microservices cho các ứng dụng trong hệ sinh thái FABi (bán hàng, vận hành, báo cáo).\nNghiên cứu, đề xuất và ứng dụng công nghệ mới, bao gồm Generative AI, vào sản phẩm và quy trình vận hành.\nLàm việc với người dùng nghiệp vụ và các bên liên quan để thu thập yêu cầu, phân tích quy trình, xác định điểm nghẽn và đề xuất giải pháp tối ưu.\nĐề xuất ý tưởng và use case ứng dụng Generative AI trong vận hành, chăm sóc khách hàng, báo cáo và tối ưu hệ thống.\nThực hiện công việc khác theo yêu cầu của quản lý sản phẩm."
    ],
    "requirements": [
      "Tốt nghiệp chuyên ngành Công nghệ thông tin, Khoa học máy tính, Điện tử viễn thông, Công nghệ phần mềm, Hệ thống thông tin hoặc tương đương.\n3+ năm kinh nghiệm lập trình Python và 1+ năm làm việc với framework Python như FastAPI, Flask hoặc Django.\nĐã triển khai Microservices hoặc tham gia thiết kế kiến trúc hệ thống quy mô vừa/lớn.\nHiểu rõ về thiết kế API RESTful (GraphQL là lợi thế).\nCó kinh nghiệm debug, troubleshooting, logging và monitoring trong môi trường production.\nĐã làm việc với cơ sở dữ liệu SQL (PostgreSQL) và NoSQL (MongoDB, Redis...), nắm vững cơ chế hoạt động và tối ưu truy vấn.\nCó kinh nghiệm triển khai và vận hành message queue như Celery, Redis Queue, RabbitMQ.\nThành thạo Git và công cụ quản lý công việc (Jira, ClickUp, Redmine), có kinh nghiệm viết tài liệu API.\nĐam mê và chủ động trong công việc, có kỹ năng làm việc nhóm và độc lập.\nCó khả năng quản lý, sắp xếp, điều phối và đốc thúc công việc.\nƯu tiên\nỨng viên trẻ, ham học hỏi và sáng tạo.\nCó kiến thức hoặc kinh nghiệm về Generative AI là lợi thế lớn.\nCó kinh nghiệm về bảo mật hệ thống (authentication, authorization, JWT...).\nHiểu biết và có khả năng xây dựng CI/CD pipelines (Jenkins, GitLab CI/CD, GitHub Actions...).\nCó tư duy sản phẩm và tinh thần ownership cao"
    ],
    "url": "https://www.topcv.vn/viec-lam/backend-developer-python-muc-luong-30tr-thang-khu-vuc-cau-giay/1995040.html?ta_source=ITJobs_LinkDetail"
  }
]